GopalSaraf/Practicals/PSDL/include/proc/pic16f19155.inc
// Register: LCDDATA36
#define LCDDATA36 LCDDATA36
LCDDATA36                                equ 01D3Ch
// bitfield definitions
LCDDATA36_S00C6_POSN                     equ 0000h
LCDDATA36_S00C6_POSITION                 equ 0000h
LCDDATA36_S00C6_SIZE                     equ 0001h
LCDDATA36_S00C6_LENGTH                   equ 0001h
LCDDATA36_S00C6_MASK                     equ 0001h
LCDDATA36_S01C6_POSN                     equ 0001h
LCDDATA36_S01C6_POSITION                 equ 0001h
LCDDATA36_S01C6_SIZE                     equ 0001h
LCDDATA36_S01C6_LENGTH                   equ 0001h
LCDDATA36_S01C6_MASK                     equ 0002h
LCDDATA36_S02C6_POSN                     equ 0002h
LCDDATA36_S02C6_POSITION                 equ 0002h
LCDDATA36_S02C6_SIZE                     equ 0001h
LCDDATA36_S02C6_LENGTH                   equ 0001h
LCDDATA36_S02C6_MASK                     equ 0004h
LCDDATA36_S03C6_POSN                     equ 0003h
LCDDATA36_S03C6_POSITION                 equ 0003h
LCDDATA36_S03C6_SIZE                     equ 0001h
LCDDATA36_S03C6_LENGTH                   equ 0001h
LCDDATA36_S03C6_MASK                     equ 0008h
LCDDATA36_S04C6_POSN                     equ 0004h
LCDDATA36_S04C6_POSITION                 equ 0004h
LCDDATA36_S04C6_SIZE                     equ 0001h
LCDDATA36_S04C6_LENGTH                   equ 0001h
LCDDATA36_S04C6_MASK                     equ 0010h
LCDDATA36_S06C6_POSN                     equ 0006h
LCDDATA36_S06C6_POSITION                 equ 0006h
LCDDATA36_S06C6_SIZE                     equ 0001h
LCDDATA36_S06C6_LENGTH                   equ 0001h
LCDDATA36_S06C6_MASK                     equ 0040h
LCDDATA36_S07C6_POSN                     equ 0007h
LCDDATA36_S07C6_POSITION                 equ 0007h
LCDDATA36_S07C6_SIZE                     equ 0001h
LCDDATA36_S07C6_LENGTH                   equ 0001h
LCDDATA36_S07C6_MASK                     equ 0080h

// Register: LCDDATA37
#define LCDDATA37 LCDDATA37
LCDDATA37                                equ 01D3Dh
// bitfield definitions
LCDDATA37_S08C6_POSN                     equ 0000h
LCDDATA37_S08C6_POSITION                 equ 0000h
LCDDATA37_S08C6_SIZE                     equ 0001h
LCDDATA37_S08C6_LENGTH                   equ 0001h
LCDDATA37_S08C6_MASK                     equ 0001h
LCDDATA37_S09C6_POSN                     equ 0001h
LCDDATA37_S09C6_POSITION                 equ 0001h
LCDDATA37_S09C6_SIZE                     equ 0001h
LCDDATA37_S09C6_LENGTH                   equ 0001h
LCDDATA37_S09C6_MASK                     equ 0002h
LCDDATA37_S10C6_POSN                     equ 0002h
LCDDATA37_S10C6_POSITION                 equ 0002h
LCDDATA37_S10C6_SIZE                     equ 0001h
LCDDATA37_S10C6_LENGTH                   equ 0001h
LCDDATA37_S10C6_MASK                     equ 0004h
LCDDATA37_S11C6_POSN                     equ 0003h
LCDDATA37_S11C6_POSITION                 equ 0003h
LCDDATA37_S11C6_SIZE                     equ 0001h
LCDDATA37_S11C6_LENGTH                   equ 0001h
LCDDATA37_S11C6_MASK                     equ 0008h
LCDDATA37_S13C6_POSN                     equ 0005h
LCDDATA37_S13C6_POSITION                 equ 0005h
LCDDATA37_S13C6_SIZE                     equ 0001h
LCDDATA37_S13C6_LENGTH                   equ 0001h
LCDDATA37_S13C6_MASK                     equ 0020h
LCDDATA37_S14C6_POSN                     equ 0006h
LCDDATA37_S14C6_POSITION                 equ 0006h
LCDDATA37_S14C6_SIZE                     equ 0001h
LCDDATA37_S14C6_LENGTH                   equ 0001h
LCDDATA37_S14C6_MASK                     equ 0040h
LCDDATA37_S15C6_POSN                     equ 0007h
LCDDATA37_S15C6_POSITION                 equ 0007h
LCDDATA37_S15C6_SIZE                     equ 0001h
LCDDATA37_S15C6_LENGTH                   equ 0001h
LCDDATA37_S15C6_MASK                     equ 0080h

// Register: LCDDATA38
#define LCDDATA38 LCDDATA38
LCDDATA38                                equ 01D3Eh
// bitfield definitions
LCDDATA38_S18C6_POSN                     equ 0002h
LCDDATA38_S18C6_POSITION                 equ 0002h
LCDDATA38_S18C6_SIZE                     equ 0001h
LCDDATA38_S18C6_LENGTH                   equ 0001h
LCDDATA38_S18C6_MASK                     equ 0004h
LCDDATA38_S19C6_POSN                     equ 0003h
LCDDATA38_S19C6_POSITION                 equ 0003h
LCDDATA38_S19C6_SIZE                     equ 0001h
LCDDATA38_S19C6_LENGTH                   equ 0001h
LCDDATA38_S19C6_MASK                     equ 0008h
LCDDATA38_S20C6_POSN                     equ 0004h
LCDDATA38_S20C6_POSITION                 equ 0004h
LCDDATA38_S20C6_SIZE                     equ 0001h
LCDDATA38_S20C6_LENGTH                   equ 0001h
LCDDATA38_S20C6_MASK                     equ 0010h
LCDDATA38_S22C6_POSN                     equ 0006h
LCDDATA38_S22C6_POSITION                 equ 0006h
LCDDATA38_S22C6_SIZE                     equ 0001h
LCDDATA38_S22C6_LENGTH                   equ 0001h
LCDDATA38_S22C6_MASK                     equ 0040h
LCDDATA38_S23C6_POSN                     equ 0007h
LCDDATA38_S23C6_POSITION                 equ 0007h
LCDDATA38_S23C6_SIZE                     equ 0001h
LCDDATA38_S23C6_LENGTH                   equ 0001h
LCDDATA38_S23C6_MASK                     equ 0080h

// Register: LCDDATA42
#define LCDDATA42 LCDDATA42
LCDDATA42                                equ 01D42h
// bitfield definitions
LCDDATA42_S00C7_POSN                     equ 0000h
LCDDATA42_S00C7_POSITION                 equ 0000h
LCDDATA42_S00C7_SIZE                     equ 0001h
LCDDATA42_S00C7_LENGTH                   equ 0001h
LCDDATA42_S00C7_MASK                     equ 0001h
LCDDATA42_S01C7_POSN                     equ 0001h
LCDDATA42_S01C7_POSITION                 equ 0001h
LCDDATA42_S01C7_SIZE                     equ 0001h
LCDDATA42_S01C7_LENGTH                   equ 0001h
LCDDATA42_S01C7_MASK                     equ 0002h
LCDDATA42_S02C7_POSN                     equ 0002h
LCDDATA42_S02C7_POSITION                 equ 0002h
LCDDATA42_S02C7_SIZE                     equ 0001h
LCDDATA42_S02C7_LENGTH                   equ 0001h
LCDDATA42_S02C7_MASK                     equ 0004h
LCDDATA42_S03C7_POSN                     equ 0003h
LCDDATA42_S03C7_POSITION                 equ 0003h
LCDDATA42_S03C7_SIZE                     equ 0001h
LCDDATA42_S03C7_LENGTH                   equ 0001h
LCDDATA42_S03C7_MASK                     equ 0008h
LCDDATA42_S04C7_POSN                     equ 0004h
LCDDATA42_S04C7_POSITION                 equ 0004h
LCDDATA42_S04C7_SIZE                     equ 0001h
LCDDATA42_S04C7_LENGTH                   equ 0001h
LCDDATA42_S04C7_MASK                     equ 0010h
LCDDATA42_S06C7_POSN                     equ 0006h
LCDDATA42_S06C7_POSITION                 equ 0006h
LCDDATA42_S06C7_SIZE                     equ 0001h
LCDDATA42_S06C7_LENGTH                   equ 0001h
LCDDATA42_S06C7_MASK                     equ 0040h
LCDDATA42_S07C7_POSN                     equ 0007h
LCDDATA42_S07C7_POSITION                 equ 0007h
LCDDATA42_S07C7_SIZE                     equ 0001h
LCDDATA42_S07C7_LENGTH                   equ 0001h
LCDDATA42_S07C7_MASK                     equ 0080h

