GopalSaraf/Practicals/PSDL/include/proc/pic16f19155.inc
#define SECH2                            BANKMASK(SECONDS), 6
#define SECL0                            BANKMASK(SECONDS), 0
#define SECL1                            BANKMASK(SECONDS), 1
#define SECL2                            BANKMASK(SECONDS), 2
#define SECL3                            BANKMASK(SECONDS), 3
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLPEN                            BANKMASK(LCDCON), 6
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SMP                              BANKMASK(SSP1STAT), 7
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMT1AS                           BANKMASK(SMT1STAT), 0
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2
#define SMT1EN                           BANKMASK(SMT1CON0), 7
#define SMT1GO                           BANKMASK(SMT1CON1), 7
#define SMT1IE                           BANKMASK(PIE8), 0
#define SMT1IF                           BANKMASK(PIR8), 0
#define SMT1MD                           BANKMASK(PMD5), 6
#define SMT1PR0                          BANKMASK(SMT1PRL), 0
#define SMT1PR1                          BANKMASK(SMT1PRL), 1
#define SMT1PR10                         BANKMASK(SMT1PRH), 2
#define SMT1PR11                         BANKMASK(SMT1PRH), 3
#define SMT1PR12                         BANKMASK(SMT1PRH), 4
#define SMT1PR13                         BANKMASK(SMT1PRH), 5
#define SMT1PR14                         BANKMASK(SMT1PRH), 6
#define SMT1PR15                         BANKMASK(SMT1PRH), 7
#define SMT1PR16                         BANKMASK(SMT1PRU), 0
#define SMT1PR17                         BANKMASK(SMT1PRU), 1
#define SMT1PR18                         BANKMASK(SMT1PRU), 2
#define SMT1PR19                         BANKMASK(SMT1PRU), 3
#define SMT1PR2                          BANKMASK(SMT1PRL), 2
#define SMT1PR20                         BANKMASK(SMT1PRU), 4
#define SMT1PR21                         BANKMASK(SMT1PRU), 5
#define SMT1PR22                         BANKMASK(SMT1PRU), 6
#define SMT1PR23                         BANKMASK(SMT1PRU), 7
#define SMT1PR3                          BANKMASK(SMT1PRL), 3
#define SMT1PR4                          BANKMASK(SMT1PRL), 4
#define SMT1PR5                          BANKMASK(SMT1PRL), 5
#define SMT1PR6                          BANKMASK(SMT1PRL), 6
#define SMT1PR7                          BANKMASK(SMT1PRL), 7
#define SMT1PR8                          BANKMASK(SMT1PRH), 0
#define SMT1PR9                          BANKMASK(SMT1PRH), 1
#define SMT1PRAIE                        BANKMASK(PIE8), 1
#define SMT1PRAIF                        BANKMASK(PIR8), 1
#define SMT1PS0                          BANKMASK(SMT1CON0), 0
#define SMT1PS1                          BANKMASK(SMT1CON0), 1
#define SMT1PWAIE                        BANKMASK(PIE8), 2
#define SMT1PWAIF                        BANKMASK(PIR8), 2
#define SMT1RESET                        BANKMASK(SMT1STAT), 5
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1
#define SMT1TS                           BANKMASK(SMT1STAT), 2
#define SMT1WS                           BANKMASK(SMT1STAT), 1
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4
#define SMU1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0
#define SMU1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1
#define SMU1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2
#define SMU1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3
#define SMU1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4
#define SMU1WINPPS0                      BANKMASK(SMT1WINPPS), 0
#define SMU1WINPPS1                      BANKMASK(SMT1WINPPS), 1
#define SMU1WINPPS2                      BANKMASK(SMT1WINPPS), 2
#define SMU1WINPPS3                      BANKMASK(SMT1WINPPS), 3
#define SMU1WINPPS4                      BANKMASK(SMT1WINPPS), 4
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SPOL                             BANKMASK(SMT1CON0), 3
#define SSEL0                            BANKMASK(SMT1SIG), 0
#define SSEL1                            BANKMASK(SMT1SIG), 1
#define SSEL2                            BANKMASK(SMT1SIG), 2
#define SSEL3                            BANKMASK(SMT1SIG), 3
#define SSEL4                            BANKMASK(SMT1SIG), 4
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE3), 0
#define SSP1IF                           BANKMASK(PIR3), 0
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define START                            BANKMASK(SSP1STAT), 3
#define START1                           BANKMASK(SSP1STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
#define STATE                            BANKMASK(WDTTMR), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP                             BANKMASK(SSP1STAT), 4
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STP                              BANKMASK(SMT1CON0), 5
#define STPT0                            BANKMASK(ADSTPTL), 0
#define STPT1                            BANKMASK(ADSTPTL), 1
#define STPT10                           BANKMASK(ADSTPTH), 2
#define STPT11                           BANKMASK(ADSTPTH), 3
#define STPT12                           BANKMASK(ADSTPTH), 4
#define STPT13                           BANKMASK(ADSTPTH), 5
#define STPT15                           BANKMASK(ADSTPTH), 6
#define STPT16                           BANKMASK(ADSTPTH), 7
#define STPT2                            BANKMASK(ADSTPTL), 2
#define STPT3                            BANKMASK(ADSTPTL), 3
#define STPT4                            BANKMASK(ADSTPTL), 4
#define STPT5                            BANKMASK(ADSTPTL), 5
#define STPT6                            BANKMASK(ADSTPTL), 6
#define STPT7                            BANKMASK(ADSTPTL), 7
#define STPT8                            BANKMASK(ADSTPTH), 0
#define STPT9                            BANKMASK(ADSTPTH), 1
#define STRA                             BANKMASK(CWG1STR), 0
#define STRB                             BANKMASK(CWG1STR), 1
#define STRC                             BANKMASK(CWG1STR), 2
#define STRD                             BANKMASK(CWG1STR), 3
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 7
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0OE                             BANKMASK(T0CON0), 6
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0OUTPS0                         BANKMASK(T0CON0), 0
#define T0OUTPS1                         BANKMASK(T0CON0), 1
#define T0OUTPS2                         BANKMASK(T0CON0), 2
#define T0OUTPS3                         BANKMASK(T0CON0), 3
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T0PS0                            BANKMASK(T0CON1), 0
#define T0PS1                            BANKMASK(T0CON1), 1
#define T0PS2                            BANKMASK(T0CON1), 2
#define T0PS3                            BANKMASK(T0CON1), 3
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
#define T1GSS3                           BANKMASK(T1GATE), 3
#define T1GSS4                           BANKMASK(T1GATE), 4
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1RD16                           BANKMASK(T1CON), 1
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2INPPS0                         BANKMASK(T2INPPS), 0
#define T2INPPS1                         BANKMASK(T2INPPS), 1
#define T2INPPS2                         BANKMASK(T2INPPS), 2
#define T2INPPS3                         BANKMASK(T2INPPS), 3
#define T2INPPS4                         BANKMASK(T2INPPS), 4
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T4CKPOL                          BANKMASK(T4HLT), 6
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CKSYNC                         BANKMASK(T4HLT), 5
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4INPPS0                         BANKMASK(T4INPPS), 0
#define T4INPPS1                         BANKMASK(T4INPPS), 1
#define T4INPPS2                         BANKMASK(T4INPPS), 2
#define T4INPPS3                         BANKMASK(T4INPPS), 3
#define T4INPPS4                         BANKMASK(T4INPPS), 4
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define TMD0                             BANKMASK(ADCON3), 0
#define TMD1                             BANKMASK(ADCON3), 1
#define TMD2                             BANKMASK(ADCON3), 2
#define TMR0H0                           BANKMASK(TMR0H), 0
#define TMR0H1                           BANKMASK(TMR0H), 1
#define TMR0H2                           BANKMASK(TMR0H), 2
#define TMR0H3                           BANKMASK(TMR0H), 3
#define TMR0H4                           BANKMASK(TMR0H), 4
#define TMR0H5                           BANKMASK(TMR0H), 5
#define TMR0H6                           BANKMASK(TMR0H), 6
#define TMR0H7                           BANKMASK(TMR0H), 7
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0L0                           BANKMASK(TMR0L), 0
#define TMR0L1                           BANKMASK(TMR0L), 1
#define TMR0L2                           BANKMASK(TMR0L), 2
#define TMR0L3                           BANKMASK(TMR0L), 3
#define TMR0L4                           BANKMASK(TMR0L), 4
#define TMR0L5                           BANKMASK(TMR0L), 5
#define TMR0L6                           BANKMASK(TMR0L), 6
#define TMR0L7                           BANKMASK(TMR0L), 7
#define TMR0MD                           BANKMASK(PMD1), 0
#define TMR10                            BANKMASK(TMR1L), 0
#define TMR11                            BANKMASK(TMR1L), 1
#define TMR110                           BANKMASK(TMR1H), 2
#define TMR111                           BANKMASK(TMR1H), 3
#define TMR112                           BANKMASK(TMR1H), 4
#define TMR113                           BANKMASK(TMR1H), 5
#define TMR114                           BANKMASK(TMR1H), 6
#define TMR115                           BANKMASK(TMR1H), 7
#define TMR12                            BANKMASK(TMR1L), 2
#define TMR13                            BANKMASK(TMR1L), 3
#define TMR14                            BANKMASK(TMR1L), 4
#define TMR15                            BANKMASK(TMR1L), 5
#define TMR16                            BANKMASK(TMR1L), 6
#define TMR17                            BANKMASK(TMR1L), 7
#define TMR18                            BANKMASK(TMR1H), 0
